*Optional step* Install python & pandas from [Anaconda](https://www.anaconda.com/products/individual)
Download `titanic2.zip` data from [nextcloud](https://nextcloud.profinit.eu/index.php/s/tBkoFo8xEJwtKnJ?path=%2Fdata)

In [1]:
import pandas as pd

pd.set_option("display.precision", 2)

The Challenge

The sinking of the Titanic is one of the most infamous shipwrecks in history.

On April 15, 1912, during her maiden voyage, the widely considered “unsinkable” RMS Titanic sank after colliding with an iceberg.
Unfortunately, there weren’t enough lifeboats for everyone onboard, resulting in the death of 1502 out of 2224 passengers and crew.

While there was some element of luck involved in surviving, it seems some groups of people were more likely to survive than others.

In this challenge, we ask you to build a predictive model that answers the question: “what sorts of people were more likely to survive?” using passenger data (ie name, age, gender, socio-economic class, etc).

(c) [Kaggle](https://www.kaggle.com/c/titanic/overview)

In [13]:
df = pd.read_csv('titanic_train.csv')

df.head()

,passenger_id,pclass,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,survived
0,1216,3,"Smyth, Miss. Julia",female,NaN,0,0,335432,7.73,NaN,Q,13,NaN,NaN,1
1,699,3,"Cacic, Mr. Luka",male,38.0,0,0,315089,8.66,NaN,S,NaN,NaN,Croatia,0
2,1267,3,"Van Impe, Mrs. Jean Baptiste (Rosalie Paula Go...",female,30.0,1,1,345773,24.15,NaN,S,NaN,NaN,NaN,0
3,449,2,"Hocking, Mrs. Elizabeth (Eliza Needs)",female,54.0,1,3,29105,23.00,NaN,S,4,NaN,"Cornwall / Akron, OH",1
4,576,2,"Veal, Mr. James",male,40.0,0,0,28221,13.00,NaN,S,NaN,NaN,"Barre, Co Washington, VT",0

1. How many rows has the dataframe?
2. How many columns has the dataframe?
3. What is the percentage of non-null values in the Age column?
4. How many text columns has the dataframe?
5. How many men and women are in the dataset?
6. What is the average age of men and women? On average who is younger?
7. What is the percentage of passengers travelling in 3rd class cabins? (Pclass variable)
8. How much did the most expensive ticket cost? (Fare variable)
9. Describe average age, proportion of females and average Fare per Pclass.
10. Who is more likely to travel alone men or women? (Consider a passenger as travelling alone if he/she has no siblings/children)
11. What is the most popular lastname? firstname? (Name column)

In [26]:
len(df)

850

In [27]:
df.shape[1]

15

In [25]:
len(df.loc[df["age"].isna()]) / df.shape[0]

0.20470588235294118

In [44]:
(df.dtypes == "object").sum()

7

In [46]:
len(df[df["sex"]=="male"])

551

In [51]:
df[df["sex"] == "male"]["age"].mean()

29.898255813953487

In [56]:
len(df[df["pclass"] == 3]) / len(df)

0.5623529411764706

In [57]:
df["fare"].max()

512.3292

In [60]:
df["name"].value_counts().idxmax()

'Kelly, Mr. James'